InformationRegisters/НастройкиОтправителя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НастройкиОтправителя</Name>
			<Comment>Используется для  хранения связей каналов с получателями этих каналов. Регистр задает рассылку по получателям со стороны отправителя.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>КаналСообщений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСообщениями</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НастройкиОтправителя/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2018
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Определяет конечные точки, для которых в текущей информационной системе назначен заданный канал сообщений.
//
// Параметры:
//  КаналСообщений - Строка - Идентификатор адресного канала сообщений.
//
// Возвращаемое значение:
//  Массив из ПланОбменаСсылка.ОбменСообщениями - массив элементов конечных точек.
//
Функция ПодписчикиКаналаСообщений(Знач КаналСообщений) Экспорт
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	НастройкиОтправителя.Получатель КАК Получатель
	|ИЗ
	|	РегистрСведений.НастройкиОтправителя КАК НастройкиОтправителя
	|ГДЕ
	|	НастройкиОтправителя.КаналСообщений = &КаналСообщений";
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("КаналСообщений", КаналСообщений);
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Получатель");
КонецФункции

#КонецОбласти

#КонецЕсли
